## Staging: load-balancer
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`





```terraform
Plan: 1 to add, 1 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudfront_distribution.wordpress will be updated in-place
  ~ resource "aws_cloudfront_distribution" "wordpress" {
        id                             = "E355EOO70XE75H"
        tags                           = {
            "CostCentre" = "PlatformGCArticles"
        }
        # (20 unchanged attributes hidden)



      + ordered_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = true
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "/uploads/*"
          + target_origin_id       = "wordpress_uploads"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = [
                  + "Origin",
                ]
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward = "none"
                }
            }
        }

      ~ origin {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }


        # (6 unchanged blocks hidden)
    }

  # aws_cloudfront_origin_access_identity.wordpress_uploads will be created
  + resource "aws_cloudfront_origin_access_identity" "wordpress_uploads" {
      + caller_reference                = (known after apply)
      + cloudfront_access_identity_path = (known after apply)
      + comment                         = "Wordpress uploads"
      + etag                            = (known after apply)
      + iam_arn                         = (known after apply)
      + id                              = (known after apply)
      + s3_canonical_user_id            = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>